benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/jaeger-benchmark-20-9.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 2.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.035ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.99ms    1.31ms   9.30ms   96.78%
    Req/Sec    10.84     33.83   111.00     90.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.79ms
 75.000%    2.00ms
 90.000%    2.20ms
 99.000%    9.30ms
 99.900%   16.00ms
 99.990%   18.13ms
 99.999%   18.13ms
100.000%   18.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.263     0.000000            1         1.00
       1.459     0.100000          105         1.11
       1.549     0.200000          207         1.25
       1.629     0.300000          308         1.43
       1.705     0.400000          411         1.67
       1.789     0.500000          513         2.00
       1.826     0.550000          565         2.22
       1.874     0.600000          615         2.50
       1.912     0.650000          668         2.86
       1.958     0.700000          719         3.33
       1.996     0.750000          771         4.00
       2.019     0.775000          798         4.44
       2.037     0.800000          820         5.00
       2.059     0.825000          846         5.71
       2.093     0.850000          872         6.67
       2.125     0.875000          898         8.00
       2.147     0.887500          912         8.89
       2.199     0.900000          924        10.00
       2.241     0.912500          936        11.43
       2.285     0.925000          949        13.33
       2.345     0.937500          961        16.00
       2.393     0.943750          968        17.78
       2.547     0.950000          974        20.00
       2.787     0.956250          981        22.86
       3.003     0.962500          987        26.67
       3.457     0.968750          993        32.00
       3.617     0.971875          997        35.56
       4.575     0.975000         1000        40.00
       4.811     0.978125         1003        45.71
       5.531     0.981250         1006        53.33
       6.807     0.984375         1009        64.00
       7.519     0.985938         1011        71.11
       8.863     0.987500         1013        80.00
       8.903     0.989062         1014        91.43
       9.783     0.990625         1016       106.67
      10.143     0.992188         1017       128.00
      10.167     0.992969         1018       142.22
      11.791     0.993750         1019       160.00
      11.959     0.994531         1020       182.86
      12.535     0.995313         1021       213.33
      12.535     0.996094         1021       256.00
      13.599     0.996484         1022       284.44
      13.599     0.996875         1022       320.00
      14.863     0.997266         1023       365.71
      14.863     0.997656         1023       426.67
      14.863     0.998047         1023       512.00
      15.999     0.998242         1024       568.89
      15.999     0.998437         1024       640.00
      15.999     0.998633         1024       731.43
      15.999     0.998828         1024       853.33
      15.999     0.999023         1024      1024.00
      18.127     0.999121         1025      1137.78
      18.127     1.000000         1025          inf
#[Mean    =        1.993, StdDeviation   =        1.308]
#[Max     =       18.112, Total count    =         1025]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1239 requests in 1.00m, 240.78KB read
  Socket errors: connect 0, read 0, write 0, timeout 433
Requests/sec:     20.64
Transfer/sec:      4.01KB