benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/jaeger-benchmark-60-8.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 40 connections
  Thread calibration: mean lat.: 1.175ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.211ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.24ms  628.61us   2.74ms   97.59%
    Req/Sec    30.72     56.99   222.00     74.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.29ms
 90.000%    1.52ms
 99.000%    2.74ms
 99.900%   10.23ms
 99.990%   13.38ms
 99.999%   13.38ms
100.000%   13.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.845     0.000000            1         1.00
       0.979     0.100000          301         1.11
       1.015     0.200000          596         1.25
       1.055     0.300000          889         1.43
       1.093     0.400000         1187         1.67
       1.137     0.500000         1476         2.00
       1.161     0.550000         1624         2.22
       1.188     0.600000         1773         2.50
       1.217     0.650000         1919         2.86
       1.249     0.700000         2063         3.33
       1.292     0.750000         2211         4.00
       1.319     0.775000         2284         4.44
       1.349     0.800000         2358         5.00
       1.387     0.825000         2433         5.71
       1.425     0.850000         2507         6.67
       1.469     0.875000         2579         8.00
       1.496     0.887500         2620         8.89
       1.517     0.900000         2653        10.00
       1.543     0.912500         2690        11.43
       1.569     0.925000         2730        13.33
       1.598     0.937500         2766        16.00
       1.611     0.943750         2782        17.78
       1.625     0.950000         2801        20.00
       1.660     0.956250         2819        22.86
       1.693     0.962500         2837        26.67
       1.748     0.968750         2855        32.00
       1.808     0.971875         2865        35.56
       1.854     0.975000         2874        40.00
       1.904     0.978125         2883        45.71
       1.958     0.981250         2893        53.33
       2.093     0.984375         2901        64.00
       2.141     0.985938         2906        71.11
       2.215     0.987500         2911        80.00
       2.357     0.989062         2915        91.43
       2.783     0.990625         2920       106.67
       2.955     0.992188         2924       128.00
       3.687     0.992969         2927       142.22
       4.183     0.993750         2929       160.00
       4.447     0.994531         2931       182.86
       5.851     0.995313         2934       213.33
       6.527     0.996094         2936       256.00
       7.819     0.996484         2937       284.44
       8.687     0.996875         2938       320.00
       9.127     0.997266         2939       365.71
       9.359     0.997656         2941       426.67
       9.431     0.998047         2942       512.00
       9.431     0.998242         2942       568.89
      10.167     0.998437         2943       640.00
      10.167     0.998633         2943       731.43
      10.231     0.998828         2944       853.33
      10.743     0.999023         2945      1024.00
      10.743     0.999121         2945      1137.78
      10.743     0.999219         2945      1280.00
      10.743     0.999316         2945      1462.86
      11.255     0.999414         2946      1706.67
      11.255     0.999512         2946      2048.00
      11.255     0.999561         2946      2275.56
      11.255     0.999609         2946      2560.00
      11.255     0.999658         2946      2925.71
      13.375     0.999707         2947      3413.33
      13.375     1.000000         2947          inf
#[Mean    =        1.241, StdDeviation   =        0.629]
#[Max     =       13.368, Total count    =         2947]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3593 requests in 1.00m, 698.25KB read
  Socket errors: connect 0, read 0, write 0, timeout 67
Requests/sec:     59.87
Transfer/sec:     11.63KB