benchmarks/socialNetwork/openshift/scripts/benchmark-exp-logs/no-tracing-exp/jaeger-benchmark-80-9.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 60 connections
  Thread calibration: mean lat.: 1.608ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.651ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.53ms    0.92ms   5.54ms   97.15%
    Req/Sec    42.08     66.59   222.00     80.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.37ms
 75.000%    1.51ms
 90.000%    1.71ms
 99.000%    5.54ms
 99.900%   13.38ms
 99.990%   21.02ms
 99.999%   21.02ms
100.000%   21.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.112     0.000000            2         1.00
       1.217     0.100000          405         1.11
       1.258     0.200000          798         1.25
       1.293     0.300000         1193         1.43
       1.329     0.400000         1590         1.67
       1.368     0.500000         1989         2.00
       1.391     0.550000         2186         2.22
       1.415     0.600000         2381         2.50
       1.440     0.650000         2583         2.86
       1.471     0.700000         2780         3.33
       1.509     0.750000         2976         4.00
       1.527     0.775000         3074         4.44
       1.550     0.800000         3174         5.00
       1.583     0.825000         3272         5.71
       1.620     0.850000         3372         6.67
       1.663     0.875000         3474         8.00
       1.680     0.887500         3520         8.89
       1.713     0.900000         3572        10.00
       1.746     0.912500         3619        11.43
       1.780     0.925000         3669        13.33
       1.834     0.937500         3719        16.00
       1.877     0.943750         3743        17.78
       1.928     0.950000         3768        20.00
       2.003     0.956250         3794        22.86
       2.175     0.962500         3818        26.67
       2.353     0.968750         3843        32.00
       2.461     0.971875         3855        35.56
       2.711     0.975000         3867        40.00
       3.173     0.978125         3880        45.71
       3.545     0.981250         3892        53.33
       4.463     0.984375         3905        64.00
       4.639     0.985938         3911        71.11
       4.959     0.987500         3917        80.00
       5.291     0.989062         3923        91.43
       5.755     0.990625         3929       106.67
       6.175     0.992188         3936       128.00
       6.707     0.992969         3939       142.22
       6.935     0.993750         3942       160.00
       7.147     0.994531         3945       182.86
       8.163     0.995313         3948       213.33
       8.999     0.996094         3951       256.00
       9.423     0.996484         3953       284.44
       9.471     0.996875         3954       320.00
      10.167     0.997266         3956       365.71
      10.591     0.997656         3957       426.67
      12.247     0.998047         3959       512.00
      12.479     0.998242         3960       568.89
      12.479     0.998437         3960       640.00
      13.295     0.998633         3961       731.43
      13.383     0.998828         3962       853.33
      15.079     0.999023         3963      1024.00
      15.079     0.999121         3963      1137.78
      15.079     0.999219         3963      1280.00
      16.591     0.999316         3964      1462.86
      16.591     0.999414         3964      1706.67
      17.359     0.999512         3965      2048.00
      17.359     0.999561         3965      2275.56
      17.359     0.999609         3965      2560.00
      17.359     0.999658         3965      2925.71
      17.359     0.999707         3965      3413.33
      21.023     0.999756         3966      4096.00
      21.023     1.000000         3966          inf
#[Mean    =        1.527, StdDeviation   =        0.922]
#[Max     =       21.008, Total count    =         3966]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4761 requests in 1.00m, 0.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 119
Requests/sec:     79.30
Transfer/sec:     15.41KB